# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Workspace02\Design01.cydsn\Design01.cyprj
# Date: Mon, 15 Dec 2025 17:43:20 GMT
#set_units -time ns
create_clock -name {UART_1_SCBCLK(FFB)} -period 8600 -waveform {0 4300} [list [get_pins {ClockBlock/ff_div_1}]]
create_clock -name {CyRouted1} -period 200 -waveform {0 100} [list [get_pins {ClockBlock/dsi_in_0}]]
create_clock -name {CyWCO} -period 30517.578125 -waveform {0 15258.7890625} [list [get_pins {ClockBlock/wco}]]
create_clock -name {CyLFClk} -period 30517.578125 -waveform {0 15258.7890625} [list [get_pins {ClockBlock/lfclk}]]
create_clock -name {CyILO} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyECO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/eco}]]
create_clock -name {CyIMO} -period 200 -waveform {0 100} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyHFClk} -period 200 -waveform {0 100} [list [get_pins {ClockBlock/hfclk}]]
create_clock -name {CySysClk} -period 200 -waveform {0 100} [list [get_pins {ClockBlock/sysclk}]]
create_generated_clock -name {UART_1_SCBCLK} -source [get_pins {ClockBlock/hfclk}] -edges {1 43 87} [list]


# Component constraints for C:\Workspace02\Design01.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Workspace02\Design01.cydsn\Design01.cyprj
# Date: Mon, 15 Dec 2025 17:43:18 GMT
